examples/local/parameter-study/originalCase/0.orig/CWater
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      CWater;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    right
    {
        type            zeroGradient;
    }
    down
    {
        //type            zeroGradient;
        type            equilibriumPhaseContactAngle;
        thetaProperties ( ( water air ) 86 95 78 0 );
        linearisationMethod none;
        alpha           500{1.0};
        beta            1;
        limit           none;
        value           uniform 0;
    }
    left
    {
        type            zeroGradient;
    }
    up
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    front
    {
        type            symmetryPlane;
    }

}


// ************************************************************************* //
