examples/local/parameter-study/originalCase/0.orig/PhiAir
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      PhiAir;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    down
    {
        type            zeroGradient;
    }
    left
    {
        type            zeroGradient;
    }
    up
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
    front
    {
        type            symmetryPlane;
    }

}


// ************************************************************************* //
