examples/local/parameter-study/originalCase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;//leastSquares;//Gauss linear skewCorrected 0.5;
}

divSchemes
{
    default        Gauss Gamma 1;
    div(phi,C)      Gauss  Gamma 1;//0.33;//interGamma 0.05;//Gauss skewCorrected Gamma 0.25;
    div(rhoPhi,U)  Gauss  Gamma 1;
    div(rho*phi,U)  Gauss limitedLinearV 1;//0.5;//Gauss skewCorrected limitedLinearV 1;
    //divDevRho      Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;//Gauss linear corrected;//skewCorrected 0.5;//
}

interpolationSchemes
{
    default           linear;
}

snGradSchemes
{
    default           corrected;//corrected;//skewCorrected 0.5;////skewCorrected 0.5;
}

fluxRequired
{
    default         no;
    Phi;
    pd;
    pcorr;
    C;
    lambdaU;
}


// ************************************************************************* //
